#+title: Cutting and Storing Text
#+author: Marian Domanski
#+date: <2025-08-10 Sun 20:55>
#+startup: overview

* DONE Storing Text in a List
CLOSED: [2025-08-10 Sun 21:27]

#+begin_src elisp
  (cons "another piece"
        '("a piece of text" "previous piece"))
#+end_src

#+RESULTS:
| another piece | a piece of text | previous piece |

#+begin_src elisp
  (car (nthcdr 1 '("another piece"
                   "a piece of text"
                   "previous piece")))
#+end_src

#+RESULTS:
: a piece of text

